# -*- coding: utf-8 -*-
"""
Created on Mon Mar 12 11:09:24 2018

@author: Orion
"""

def base():
    """
    База данных
    Параметров нет
    Возвращает список списков
    Автор Животов Г.О.
    """
    Иванов = ["Павел Иванов", "муж",42,30000,0,"маркетинг"]
    Сидоров = ["Юрий Сидоров", "муж",32,35000,3,"финансы"]
    Чернова = ["Татьяна Чернова", "жен",53,40000,10,"продажи"]
    Корюшка = ["Ирина Корюшка", "жен",23,20000,2,"маркетинг"]
    Берг = ["Игорь Берг", "муж",33,25000,6,"продажи"]
    Климов = ["Андрей Климов", "муж",60,60000,0,"финансы"]
    return[Иванов, Сидоров, Чернова, Корюшка, Берг, Климов]
def pech(w):
    """
    Печать базы данных
    Автор: Животов Глеб
    """
    
    for i in w:
        print(i)
def vedomost(w):
    files=open("D:/study/Work/Data/ved.txt", "w")
    for people in w:
        fn=people[0].split()
        print(str(fn[1])+"=>"+str(people[3]),file=files)
    files.close()
w=base()
vedomost(w)
print("end.")